{
  "<PAD>": 0,
  "<MASK>": 1,
  "<UNK>": 2,
  "<PKMN_CLS>": 3,
  "<TEAM_CLS>": 4,
  "type:ground": 5,
  "type:ghost": 6,
  "base_stat:hp:89": 7,
  "base_stat:atk:124": 8,
  "base_stat:def:80": 9,
  "base_stat:spa:55": 10,
  "base_stat:spd:80": 11,
  "base_stat:spe:55": 12,
  "item:golurkite": 13,
  "ability:ironfist": 14,
  "nature:unknown": 15,
  "move:poltergeist": 16,
  "move:headlongrush": 17,
  "move:protect": 18,
  "move:phantomforce": 19,
  "type:fire": 20,
  "base_stat:hp:70": 21,
  "base_stat:atk:85": 22,
  "base_stat:def:140": 23,
  "base_stat:spa:85": 24,
  "base_stat:spd:70": 25,
  "base_stat:spe:20": 26,
  "item:charcoal": 27,
  "ability:drought": 28,
  "move:eruption": 29,
  "move:heatwave": 30,
  "move:earthpower": 31,
  "type:normal": 32,
  "type:psychic": 33,
  "base_stat:hp:120": 34,
  "base_stat:atk:90": 35,
  "base_stat:def:70": 36,
  "base_stat:spa:110": 37,
  "base_stat:spe:60": 38,
  "item:sitrusberry": 39,
  "ability:armortail": 40,
  "move:psychicnoise": 41,
  "move:dazzlinggleam": 42,
  "move:helpinghand": 43,
  "move:trickroom": 44,
  "type:fighting": 45,
  "type:steel": 46,
  "base_stat:atk:110": 47,
  "base_stat:spa:115": 48,
  "base_stat:spe:90": 49,
  "item:choicescarf": 50,
  "ability:innerfocus": 51,
  "move:finalgambit": 52,
  "move:closecombat": 53,
  "move:icepunch": 54,
  "move:coaching": 55,
  "type:fairy": 56,
  "base_stat:hp:101": 57,
  "base_stat:atk:72": 58,
  "base_stat:def:72": 59,
  "base_stat:spa:99": 60,
  "base_stat:spd:89": 61,
  "base_stat:spe:29": 62,
  "item:leftovers": 63,
  "ability:aromaveil": 64,
  "move:healpulse": 65,
  "base_stat:hp:105": 66,
  "base_stat:atk:95": 67,
  "base_stat:spa:40": 68,
  "item:chopleberry": 69,
  "ability:scrappy": 70,
  "move:fakeout": 71,
  "move:lastresort": 72,
  "type:rock": 73,
  "type:flying": 74,
  "base_stat:hp:80": 75,
  "base_stat:atk:105": 76,
  "base_stat:def:65": 77,
  "base_stat:spa:60": 78,
  "base_stat:spd:75": 79,
  "base_stat:spe:130": 80,
  "item:focussash": 81,
  "ability:unnerve": 82,
  "move:tailwind": 83,
  "move:rockslide": 84,
  "move:wideguard": 85,
  "base_stat:hp:78": 86,
  "base_stat:atk:84": 87,
  "base_stat:def:78": 88,
  "base_stat:spa:109": 89,
  "base_stat:spd:85": 90,
  "base_stat:spe:100": 91,
  "item:charizarditey": 92,
  "ability:solarpower": 93,
  "move:weatherball": 94,
  "move:solarbeam": 95,
  "base_stat:hp:74": 96,
  "base_stat:atk:65": 97,
  "base_stat:def:67": 98,
  "base_stat:spa:125": 99,
  "base_stat:spd:128": 100,
  "base_stat:spe:92": 101,
  "item:floettite": 102,
  "ability:flowerveil": 103,
  "move:moonblast": 104,
  "move:lightofruin": 105,
  "type:dark": 106,
  "type:dragon": 107,
  "base_stat:hp:92": 108,
  "base_stat:def:90": 109,
  "base_stat:spd:90": 110,
  "base_stat:spe:98": 111,
  "item:habanberry": 112,
  "ability:levitate": 113,
  "move:darkpulse": 114,
  "move:dracometeor": 115,
  "base_stat:hp:108": 116,
  "base_stat:atk:130": 117,
  "base_stat:def:95": 118,
  "base_stat:spa:80": 119,
  "base_stat:spe:102": 120,
  "ability:roughskin": 121,
  "move:earthquake": 122,
  "move:dragonclaw": 123,
  "move:ironhead": 124,
  "type:electric": 125,
  "type:water": 126,
  "base_stat:hp:50": 127,
  "base_stat:def:107": 128,
  "base_stat:spa:105": 129,
  "base_stat:spd:107": 130,
  "base_stat:spe:86": 131,
  "move:voltswitch": 132,
  "move:willowisp": 133,
  "move:hydropump": 134,
  "type:poison": 135,
  "base_stat:def:60": 136,
  "base_stat:spe:120": 137,
  "ability:unburden": 138,
  "move:direclaw": 139,
  "base_stat:atk:112": 140,
  "base_stat:spe:78": 141,
  "ability:adaptability": 142,
  "move:flipturn": 143,
  "move:wavecrash": 144,
  "move:lastrespects": 145,
  "move:aquajet": 146,
  "base_stat:hp:83": 147,
  "base_stat:atk:55": 148,
  "base_stat:spa:130": 149,
  "base_stat:spd:81": 150,
  "item:glimmoranite": 151,
  "ability:toxicdebris": 152,
  "move:spikyshield": 153,
  "move:powergem": 154,
  "move:sludgebomb": 155,
  "ability:blaze": 156,
  "type:grass": 157,
  "base_stat:hp:60": 158,
  "base_stat:atk:67": 159,
  "base_stat:def:85": 160,
  "base_stat:spa:77": 161,
  "base_stat:spe:116": 162,
  "item:kebiaberry": 163,
  "ability:prankster": 164,
  "move:encore": 165,
  "base_stat:hp:100": 166,
  "base_stat:atk:134": 167,
  "base_stat:def:110": 168,
  "base_stat:spa:95": 169,
  "base_stat:spd:100": 170,
  "base_stat:spe:61": 171,
  "ability:sandstream": 172,
  "move:stoneedge": 173,
  "move:crunch": 174,
  "ability:sandveil": 175,
  "move:stompingtantrum": 176,
  "move:poisonjab": 177,
  "base_stat:atk:82": 178,
  "base_stat:def:100": 179,
  "base_stat:spa:83": 180,
  "base_stat:spe:80": 181,
  "item:meganiumite": 182,
  "ability:leafguard": 183,
  "base_stat:atk:50": 184,
  "base_stat:spa:50": 185,
  "base_stat:spd:140": 186,
  "item:shucaberry": 187,
  "ability:stancechange": 188,
  "move:sacredsword": 189,
  "move:shadowsneak": 190,
  "move:kingsshield": 191,
  "move:taunt": 192,
  "base_stat:hp:75": 193,
  "base_stat:atk:69": 194,
  "base_stat:spa:114": 195,
  "base_stat:spe:104": 196,
  "item:delphoxite": 197,
  "move:flamethrower": 198,
  "move:psychic": 199,
  "base_stat:hp:72": 200,
  "base_stat:spa:103": 201,
  "base_stat:spd:71": 202,
  "base_stat:spe:122": 203,
  "item:greninjite": 204,
  "ability:protean": 205,
  "move:icebeam": 206,
  "move:watershuriken": 207,
  "base_stat:spe:65": 208,
  "ability:drizzle": 209,
  "move:hurricane": 210,
  "base_stat:hp:90": 211,
  "base_stat:def:130": 212,
  "base_stat:spd:65": 213,
  "base_stat:spe:85": 214,
  "ability:stamina": 215,
  "move:electroshot": 216,
  "move:flashcannon": 217,
  "move:snarl": 218,
  "ability:swiftswim": 219,
  "move:psychicfangs": 220,
  "base_stat:spe:110": 221,
  "item:gengarite": 222,
  "ability:cursedbody": 223,
  "move:shadowball": 224,
  "move:icywind": 225,
  "move:disable": 226,
  "base_stat:atk:120": 227,
  "base_stat:def:98": 228,
  "base_stat:spd:98": 229,
  "base_stat:spe:72": 230,
  "item:miracleseed": 231,
  "ability:queenlymajesty": 232,
  "move:powerwhip": 233,
  "move:tripleaxel": 234,
  "base_stat:hp:73": 235,
  "base_stat:spa:119": 236,
  "base_stat:spe:95": 237,
  "move:overheat": 238,
  "base_stat:def:105": 239,
  "base_stat:spa:30": 240,
  "item:mysticwater": 241,
  "ability:intimidate": 242,
  "base_stat:hp:88": 243,
  "base_stat:def:75": 244,
  "base_stat:spa:100": 245,
  "base_stat:spe:142": 246,
  "item:colburberry": 247,
  "ability:clearbody": 248,
  "move:dragondarts": 249,
  "move:suckerpunch": 250,
  "move:sunnyday": 251,
  "base_stat:def:125": 252,
  "base_stat:spd:105": 253,
  "ability:overcoat": 254,
  "move:clangoroussoul": 255,
  "move:clangingscales": 256,
  "move:aurasphere": 257,
  "move:perishsong": 258,
  "base_stat:atk:70": 259,
  "base_stat:spa:70": 260,
  "item:altarianite": 261,
  "ability:cloudnine": 262,
  "move:hypervoice": 263,
  "base_stat:hp:71": 264,
  "base_stat:atk:60": 265,
  "base_stat:def:106": 266,
  "base_stat:spa:121": 267,
  "base_stat:spe:70": 268,
  "ability:hospitality": 269,
  "move:matchagotcha": 270,
  "move:ragepowder": 271,
  "move:strengthsap": 272,
  "base_stat:hp:95": 273,
  "base_stat:atk:115": 274,
  "move:flareblitz": 275,
  "move:partingshot": 276,
  "base_stat:atk:135": 277,
  "base_stat:def:120": 278,
  "base_stat:spe:50": 279,
  "ability:defiant": 280,
  "move:swordsdance": 281,
  "move:endeavor": 282,
  "ability:infiltrator": 283,
  "move:thunderbolt": 284,
  "type:ice": 285,
  "base_stat:hp:110": 286,
  "base_stat:spd:60": 287,
  "item:softsand": 288,
  "ability:oblivious": 289,
  "move:highhorsepower": 290,
  "move:iceshard": 291,
  "move:twinbeam": 292,
  "move:imprison": 293,
  "item:aerodactylite": 294,
  "move:dualwingbeat": 295,
  "item:tyranitarite": 296,
  "move:knockoff": 297,
  "move:lowkick": 298,
  "base_stat:hp:98": 299,
  "base_stat:atk:87": 300,
  "base_stat:spa:53": 301,
  "base_stat:spe:67": 302,
  "ability:mirrorarmor": 303,
  "move:bravebird": 304,
  "move:bulkup": 305,
  "move:roost": 306,
  "base_stat:def:79": 307,
  "base_stat:spd:125": 308,
  "base_stat:spe:81": 309,
  "ability:competitive": 310,
  "move:scald": 311,
  "move:recover": 312,
  "base_stat:def:83": 313,
  "item:venusaurite": 314,
  "ability:overgrow": 315,
  "move:gigadrain": 316,
  "base_stat:hp:64": 317,
  "base_stat:spd:63": 318,
  "item:banettite": 319,
  "ability:frisk": 320,
  "move:destinybond": 321,
  "move:raindance": 322,
  "ability:rockhead": 323,
  "move:dragonpulse": 324,
  "base_stat:spd:130": 325,
  "item:fairyfeather": 326,
  "ability:pixilate": 327,
  "move:quickattack": 328,
  "move:yawn": 329,
  "base_stat:hp:55": 330,
  "base_stat:spe:96": 331,
  "item:lumberry": 332,
  "ability:disguise": 333,
  "move:playrough": 334,
  "move:discharge": 335,
  "ability:magician": 336,
  "type:bug": 337,
  "item:scizorite": 338,
  "ability:technician": 339,
  "move:bulletpunch": 340,
  "move:bugbite": 341,
  "move:rocktomb": 342,
  "base_stat:spa:81": 343,
  "base_stat:spe:109": 344,
  "ability:snowwarning": 345,
  "move:blizzard": 346,
  "move:freezedry": 347,
  "move:throatchop": 348,
  "base_stat:hp:79": 349,
  "base_stat:atk:83": 350,
  "item:blastoisinite": 351,
  "ability:raindish": 352,
  "move:waterspout": 353,
  "ability:sturdy": 354,
  "move:lifedew": 355,
  "base_stat:atk:81": 356,
  "base_stat:def:71": 357,
  "base_stat:spa:74": 358,
  "base_stat:spd:69": 359,
  "base_stat:spe:126": 360,
  "ability:galewings": 361,
  "move:fireblast": 362,
  "item:whiteherb": 363,
  "move:acrobatics": 364,
  "ability:chlorophyll": 365,
  "move:leafstorm": 366,
  "move:sleeppowder": 367,
  "move:feint": 368,
  "base_stat:atk:75": 369,
  "base_stat:spa:65": 370,
  "base_stat:spe:111": 371,
  "item:kingsrock": 372,
  "move:populationbomb": 373,
  "move:bite": 374,
  "move:kowtowcleave": 375,
  "ability:soundproof": 376,
  "base_stat:atk:92": 377,
  "move:muddywater": 378,
  "move:airslash": 379,
  "move:energyball": 380,
  "move:acidspray": 381,
  "move:electroweb": 382,
  "move:irondefense": 383,
  "move:bodypress": 384,
  "base_stat:hp:68": 385,
  "base_stat:spd:115": 386,
  "item:gardevoirite": 387,
  "ability:trace": 388,
  "item:charizarditex": 389,
  "move:dragondance": 390,
  "ability:poisontouch": 391,
  "base_stat:atk:48": 392,
  "base_stat:def:76": 393,
  "move:lightscreen": 394,
  "item:dragonfang": 395,
  "base_stat:spa:90": 396,
  "item:magnet": 397,
  "move:grassknot": 398,
  "move:sludgewave": 399,
  "move:thunder": 400,
  "move:uturn": 401,
  "item:cobaberry": 402,
  "base_stat:hp:65": 403,
  "base_stat:atk:108": 404,
  "base_stat:spa:108": 405,
  "base_stat:spe:75": 406,
  "item:scovillainite": 407,
  "ability:moody": 408,
  "move:leechseed": 409,
  "base_stat:hp:85": 410,
  "base_stat:spa:135": 411,
  "ability:flamebody": 412,
  "move:quiverdance": 413,
  "base_stat:def:180": 414,
  "item:aggronite": 415,
  "move:heavyslam": 416,
  "base_stat:atk:80": 417,
  "item:froslassite": 418,
  "move:auroraveil": 419,
  "move:scaleshot": 420,
  "base_stat:atk:98": 421,
  "base_stat:def:63": 422,
  "base_stat:spa:98": 423,
  "base_stat:spe:101": 424,
  "ability:torrent": 425,
  "base_stat:atk:76": 426,
  "base_stat:def:84": 427,
  "base_stat:spa:54": 428,
  "base_stat:spd:96": 429,
  "base_stat:spe:105": 430,
  "item:lopunnite": 431,
  "ability:cutecharm": 432,
  "move:drainpunch": 433,
  "move:liquidation": 434,
  "item:sharpbeak": 435,
  "move:tropkick": 436,
  "base_stat:def:45": 437,
  "base_stat:spd:95": 438,
  "item:alakazite": 439,
  "ability:magicguard": 440,
  "base_stat:atk:88": 441,
  "base_stat:def:50": 442,
  "base_stat:spa:88": 443,
  "base_stat:spd:50": 444,
  "base_stat:spe:106": 445,
  "item:quickclaw": 446,
  "base_stat:spa:145": 447,
  "item:chandelurite": 448,
  "ability:flashfire": 449,
  "move:headsmash": 450,
  "move:extremespeed": 451,
  "item:brightpowder": 452,
  "move:thunderwave": 453,
  "move:seedbomb": 454,
  "move:temperflare": 455,
  "move:spicyextract": 456,
  "item:mentalherb": 457,
  "item:blackglasses": 458,
  "ability:supremeoverlord": 459,
  "ability:friendguard": 460,
  "move:followme": 461,
  "base_stat:hp:57": 462,
  "base_stat:spa:136": 463,
  "base_stat:spd:103": 464,
  "item:kasibberry": 465,
  "ability:magicbounce": 466,
  "base_stat:hp:91": 467,
  "item:dragoninite": 468,
  "ability:multiscale": 469,
  "item:lucarionite": 470,
  "move:steelbeam": 471,
  "base_stat:spa:45": 472,
  "base_stat:spe:125": 473,
  "ability:pickpocket": 474,
  "move:beatup": 475,
  "move:bugbuzz": 476,
  "move:meteormash": 477,
  "base_stat:atk:117": 478,
  "base_stat:def:73": 479,
  "ability:unaware": 480,
  "move:shellsmash": 481,
  "move:allyswitch": 482,
  "base_stat:atk:100": 483,
  "base_stat:spe:35": 484,
  "item:passhoberry": 485,
  "ability:purifyingsalt": 486,
  "move:saltcure": 487,
  "base_stat:def:118": 488,
  "base_stat:spa:68": 489,
  "base_stat:spd:72": 490,
  "base_stat:spe:47": 491,
  "move:roar": 492,
  "ability:synchronize": 493,
  "item:sablenite": 494,
  "move:confuseray": 495,
  "ability:snowcloak": 496,
  "move:scorchingsands": 497,
  "move:faketears": 498,
  "base_stat:spd:150": 499,
  "ability:shellarmor": 500,
  "move:shelter": 501,
  "base_stat:atk:106": 502,
  "base_stat:spa:86": 503,
  "item:blackbelt": 504,
  "ability:dryskin": 505,
  "base_stat:spe:118": 506,
  "item:hawluchanite": 507,
  "ability:limber": 508,
  "move:crosschop": 509,
  "move:entrainment": 510,
  "base_stat:hp:160": 511,
  "base_stat:spd:110": 512,
  "base_stat:spe:30": 513,
  "ability:thickfat": 514,
  "move:fissure": 515,
  "move:stockpile": 516,
  "move:smackdown": 517,
  "move:iciclecrash": 518,
  "ability:noguard": 519,
  "move:dynamicpunch": 520,
  "base_stat:hp:109": 521,
  "base_stat:atk:64": 522,
  "base_stat:def:91": 523,
  "base_stat:spd:83": 524,
  "base_stat:spe:45": 525,
  "ability:electromorphosis": 526,
  "move:slackoff": 527,
  "move:appleacid": 528,
  "move:substitute": 529,
  "move:upperhand": 530,
  "item:wacanberry": 531,
  "base_stat:spe:88": 532,
  "item:excadrite": 533,
  "ability:sandrush": 534,
  "move:megahorn": 535,
  "move:icefang": 536,
  "base_stat:def:55": 537,
  "ability:lightningrod": 538,
  "move:surf": 539,
  "ability:telepathy": 540,
  "move:psyshock": 541,
  "base_stat:spa:92": 542,
  "item:abomasite": 543,
  "move:chillingwater": 544,
  "item:garchompite": 545,
  "item:roseliberry": 546,
  "move:reflect": 547,
  "move:quash": 548,
  "move:sandtomb": 549,
  "base_stat:hp:103": 550,
  "base_stat:def:86": 551,
  "base_stat:spd:86": 552,
  "item:audinite": 553,
  "ability:regenerator": 554,
  "move:drainingkiss": 555,
  "move:calmmind": 556,
  "ability:ripen": 557,
  "move:gravapple": 558,
  "move:copycat": 559,
  "base_stat:atk:140": 560,
  "move:machpunch": 561,
  "move:thunderpunch": 562,
  "base_stat:hp:123": 563,
  "base_stat:atk:77": 564,
  "base_stat:spd:92": 565,
  "base_stat:spe:58": 566,
  "item:kangaskhanite": 567,
  "move:doubleedge": 568,
  "item:twistedspoon": 569,
  "ability:keeneye": 570,
  "move:drillpeck": 571,
  "base_stat:spd:87": 572,
  "item:occaberry": 573,
  "base_stat:def:40": 574,
  "base_stat:spd:40": 575,
  "item:sharpedonite": 576,
  "ability:speedboost": 577,
  "base_stat:hp:62": 578,
  "base_stat:def:52": 579,
  "base_stat:spd:94": 580,
  "move:dragonrush": 581,
  "move:waterpulse": 582,
  "move:coil": 583,
  "move:hypnosis": 584,
  "ability:pressure": 585,
  "move:gunkshot": 586,
  "ability:insomnia": 587,
  "move:darkestlariat": 588,
  "move:instruct": 589,
  "item:yacheberry": 590,
  "ability:hypercutter": 591,
  "move:highjumpkick": 592,
  "base_stat:def:77": 593,
  "base_stat:spe:94": 594,
  "ability:moldbreaker": 595,
  "move:gigatonhammer": 596,
  "move:trick": 597,
  "base_stat:spe:115": 598,
  "item:starminite": 599,
  "ability:naturalcure": 600,
  "move:icespinner": 601,
  "base_stat:atk:74": 602,
  "base_stat:def:74": 603,
  "base_stat:spa:126": 604,
  "base_stat:spd:116": 605,
  "ability:liquidvoice": 606,
  "move:skillswap": 607,
  "move:detect": 608,
  "move:strugglebug": 609,
  "base_stat:atk:109": 610,
  "base_stat:spa:75": 611,
  "base_stat:spe:56": 612,
  "move:woodhammer": 613,
  "move:haze": 614,
  "move:foulplay": 615,
  "move:hyperbeam": 616,
  "item:chimechite": 617,
  "base_stat:atk:125": 618,
  "move:waterfall": 619,
  "item:spelltag": 620,
  "item:silkscarf": 621,
  "move:superfang": 622,
  "ability:hugepower": 623,
  "move:bellydrum": 624,
  "move:round": 625,
  "base_stat:spe:40": 626,
  "item:cameruptite": 627,
  "ability:solidrock": 628,
  "move:tidyup": 629,
  "ability:quickdraw": 630,
  "move:shellsidearm": 631,
  "base_stat:atk:107": 632,
  "base_stat:spe:71": 633,
  "move:minimize": 634,
  "move:sandstorm": 635,
  "item:chartiberry": 636,
  "ability:illuminate": 637,
  "move:selfdestruct": 638,
  "move:rapidspin": 639,
  "move:bodyslam": 640,
  "move:leafblade": 641,
  "move:triplearrows": 642,
  "ability:immunity": 643,
  "move:mysticalfire": 644,
  "base_stat:def:122": 645,
  "base_stat:spe:64": 646,
  "item:chesnaughtite": 647,
  "ability:bulletproof": 648,
  "move:eeriespell": 649,
  "item:skarmorite": 650,
  "move:wish": 651,
  "move:quickguard": 652,
  "move:facade": 653,
  "item:galladite": 654,
  "ability:justified": 655,
  "ability:steadfast": 656,
  "move:stealthrock": 657,
  "base_stat:def:200": 658,
  "item:steelixite": 659,
  "base_stat:spd:91": 660,
  "base_stat:spe:36": 661,
  "move:batonpass": 662,
  "item:gyaradosite": 663,
  "item:nevermeltice": 664,
  "base_stat:def:92": 665,
  "base_stat:spd:132": 666,
  "base_stat:spe:42": 667,
  "ability:waterbubble": 668,
  "move:leechlife": 669,
  "item:metalcoat": 670,
  "base_stat:spa:79": 671,
  "item:feraligite": 672,
  "move:fierydance": 673,
  "move:psychocut": 674,
  "ability:sheerforce": 675,
  "move:nastyplot": 676,
  "ability:stalwart": 677,
  "base_stat:spd:62": 678,
  "ability:zerotohero": 679,
  "move:jetpunch": 680,
  "move:firepunch": 681,
  "item:slowbronite": 682,
  "base_stat:hp:115": 683,
  "base_stat:spd:55": 684,
  "item:rindoberry": 685,
  "ability:magmaarmor": 686,
  "base_stat:spe:79": 687,
  "base_stat:hp:97": 688,
  "base_stat:atk:132": 689,
  "base_stat:spa:62": 690,
  "base_stat:spd:67": 691,
  "base_stat:spe:43": 692,
  "item:crabominite": 693,
  "move:icehammer": 694,
  "item:victreebelite": 695,
  "move:outrage": 696,
  "move:focusblast": 697,
  "base_stat:spd:79": 698,
  "move:supercellslam": 699,
  "ability:cudchew": 700,
  "item:unknown": 701,
  "base_stat:atk:63": 702,
  "base_stat:def:152": 703,
  "base_stat:spd:142": 704,
  "move:infestation": 705,
  "move:toxic": 706,
  "move:banefulbunker": 707,
  "move:expandingforce": 708,
  "move:psychicterrain": 709,
  "move:firefang": 710,
  "move:mortalspin": 711,
  "base_stat:spe:112": 712,
  "item:hardstone": 713,
  "move:drillrun": 714,
  "move:chillyreception": 715,
  "move:safeguard": 716,
  "move:superpower": 717,
  "base_stat:hp:84": 718,
  "base_stat:atk:86": 719,
  "base_stat:def:88": 720,
  "base_stat:spa:111": 721,
  "base_stat:spd:101": 722,
  "move:vacuumwave": 723,
  "ability:sharpness": 724,
  "move:babydolleyes": 725,
  "move:mirrorcoat": 726,
  "move:breakingswipe": 727,
  "ability:weakarmor": 728,
  "item:scopelens": 729,
  "move:focusenergy": 730,
  "base_stat:hp:58": 731,
  "base_stat:def:145": 732,
  "ability:mummy": 733,
  "base_stat:atk:52": 734,
  "base_stat:spe:89": 735,
  "ability:compoundeyes": 736,
  "move:xscissor": 737,
  "move:stoneaxe": 738,
  "move:nightslash": 739,
  "item:pinsirite": 740,
  "move:doublehit": 741,
  "move:afteryou": 742,
  "move:endure": 743,
  "move:bulldoze": 744,
  "move:infernalparade": 745,
  "move:nuzzle": 746,
  "base_stat:hp:130": 747,
  "ability:waterabsorb": 748,
  "base_stat:hp:76": 749,
  "base_stat:spe:123": 750,
  "move:flowertrick": 751,
  "move:paraboliccharge": 752,
  "base_stat:atk:104": 753,
  "base_stat:spa:104": 754,
  "base_stat:spe:108": 755,
  "ability:eartheater": 756,
  "move:shedtail": 757,
  "move:psyshieldbash": 758,
  "move:curse": 759,
  "item:pidgeotite": 760,
  "move:uproar": 761,
  "move:ancientpower": 762,
  "move:pollenpuff": 763,
  "move:whirlwind": 764,
  "move:painsplit": 765,
  "move:wildcharge": 766,
  "move:hex": 767,
  "item:drampanite": 768,
  "move:speedswap": 769,
  "move:lashout": 770,
  "move:gravity": 771,
  "item:poisonbarb": 772,
  "move:electrify": 773,
  "move:mudslap": 774,
  "base_stat:atk:73": 775,
  "base_stat:spa:120": 776,
  "base_stat:spe:59": 777,
  "ability:megalauncher": 778,
  "ability:guts": 779,
  "move:bitterblade": 780,
  "item:ampharosite": 781,
  "ability:static": 782,
  "base_stat:spa:101": 783,
  "move:luminacrash": 784,
  "item:clefablite": 785,
  "move:moonlight": 786,
  "move:storedpower": 787,
  "move:lunge": 788,
  "move:cottonguard": 789,
  "base_stat:atk:66": 790,
  "base_stat:spd:99": 791,
  "base_stat:spe:32": 792,
  "move:ragingbull": 793,
  "move:rest": 794,
  "move:synthesis": 795,
  "item:shellbell": 796,
  "move:shadowclaw": 797,
  "item:beedrillite": 798,
  "ability:sniper": 799,
  "base_stat:spe:103": 800,
  "ability:motordrive": 801,
  "item:manectite": 802,
  "move:swagger": 803,
  "item:persimberry": 804,
  "move:rockblast": 805,
  "move:crabhammer": 806,
  "ability:heatproof": 807,
  "move:aerialace": 808,
  "ability:icebody": 809,
  "move:sheercold": 810,
  "move:lowsweep": 811,
  "move:extrasensory": 812,
  "ability:berserk": 813,
  "move:zenheadbutt": 814,
  "move:brickbreak": 815,
  "ability:moxie": 816,
  "move:aquastep": 817,
  "base_stat:atk:56": 818,
  "base_stat:spd:77": 819,
  "move:eerieimpulse": 820,
  "move:payback": 821,
  "base_stat:spe:82": 822,
  "move:irontail": 823,
  "move:memento": 824,
  "ability:screencleaner": 825,
  "ability:angerpoint": 826,
  "ability:lightmetal": 827,
  "move:nightshade": 828,
  "move:dragontail": 829,
  "move:worryseed": 830,
  "move:fling": 831,
  "ability:symbiosis": 832,
  "move:hammerarm": 833,
  "base_stat:hp:104": 834,
  "base_stat:spe:66": 835,
  "move:torchsong": 836,
  "move:avalanche": 837,
  "item:heracronite": 838,
  "move:pinmissile": 839,
  "move:bulletseed": 840,
  "ability:owntempo": 841,
  "ability:voltabsorb": 842,
  "move:alluringvoice": 843,
  "base_stat:atk:123": 844,
  "item:emboarite": 845,
  "move:heatcrash": 846,
  "move:glare": 847,
  "move:blazekick": 848,
  "ability:analytic": 849,
  "item:babiriberry": 850,
  "move:assurance": 851,
  "item:glalitite": 852,
  "move:doubleteam": 853,
  "base_stat:spd:121": 854,
  "move:decorate": 855,
  "move:soak": 856,
  "move:firespin": 857,
  "move:whirlpool": 858,
  "base_stat:spd:82": 859,
  "ability:harvest": 860,
  "move:hornleech": 861,
  "move:dive": 862,
  "ability:poisonpoint": 863,
  "move:trailblaze": 864,
  "base_stat:def:82": 865,
  "ability:aftermath": 866,
  "move:toxicspikes": 867,
  "move:focuspunch": 868,
  "move:steelwing": 869,
  "base_stat:def:108": 870,
  "base_stat:spd:108": 871,
  "move:snowscape": 872,
  "item:absolite": 873,
  "move:dragoncheer": 874,
  "move:magicroom": 875,
  "move:venoshock": 876,
  "move:spikes": 877,
  "base_stat:hp:48": 878,
  "base_stat:def:48": 879,
  "base_stat:spa:48": 880,
  "base_stat:spd:48": 881,
  "base_stat:spe:48": 882,
  "ability:imposter": 883,
  "move:transform": 884,
  "item:chestoberry": 885,
  "ability:heavymetal": 886,
  "move:featherdance": 887,
  "move:powersplit": 888,
  "move:attract": 889,
  "item:meowsticite": 890,
  "move:thief": 891,
  "move:futuresight": 892,
  "ability:swarm": 893,
  "move:chargebeam": 894,
  "move:dig": 895,
  "ability:healer": 896,
  "move:switcheroo": 897,
  "move:cottonspore": 898,
  "move:aircutter": 899,
  "move:petalblizzard": 900,
  "ability:marvelscale": 901,
  "item:payapaberry": 902,
  "ability:wanderingspirit": 903,
  "ability:hustle": 904,
  "base_stat:hp:106": 905,
  "base_stat:spe:44": 906,
  "move:ficklebeam": 907,
  "move:boomburst": 908,
  "move:triattack": 909,
  "move:magicpowder": 910,
  "ability:quickfeet": 911,
  "base_stat:hp:82": 912,
  "base_stat:atk:121": 913,
  "base_stat:def:119": 914,
  "base_stat:spa:69": 915,
  "base_stat:spd:59": 916,
  "base_stat:def:69": 917,
  "base_stat:atk:165": 918,
  "base_stat:spe:113": 919,
  "ability:contrary": 920,
  "move:stringshot": 921,
  "move:electricterrain": 922,
  "ability:surgesurfer": 923,
  "base_stat:spe:91": 924,
  "ability:skilllink": 925,
  "move:beakblast": 926,
  "move:guillotine": 927,
  "move:stunspore": 928,
  "move:teeterdance": 929,
  "move:acupressure": 930,
  "ability:tangledfeet": 931,
  "ability:shielddust": 932,
  "ability:shedskin": 933,
  "item:focusband": 934,
  "move:simplebeam": 935,
  "move:armorcannon": 936,
  "move:hydrocannon": 937,
  "move:howl": 938,
  "base_stat:spe:117": 939,
  "ability:sapsipper": 940,
  "move:megakick": 941,
  "move:circlethrow": 942,
  "base_stat:spa:97": 943,
  "move:crosspoison": 944,
  "move:sleeptalk": 945,
  "move:defog": 946,
  "ability:plus": 947,
  "move:healingwish": 948,
  "ability:gooey": 949,
  "move:frostbreath": 950,
  "move:ceaselessedge": 951,
  "move:gyroball": 952,
  "move:morningsun": 953,
  "ability:whitesmoke": 954,
  "move:scaryface": 955,
  "move:aquacutter": 956,
  "ability:earlybird": 957,
  "ability:furcoat": 958,
  "move:gigaimpact": 959,
  "ability:superluck": 960,
  "move:growth": 961,
  "move:stickyweb": 962,
  "move:accelerock": 963,
  "move:cosmicpower": 964,
  "base_stat:def:168": 965,
  "base_stat:spa:47": 966,
  "base_stat:spd:138": 967,
  "move:solarblade": 968,
  "move:explosion": 969,
  "move:flamecharge": 970,
  "move:powertrip": 971,
  "ability:sweetveil": 972,
  "move:gastroacid": 973,
  "ability:slushrush": 974,
  "item:medichamite": 975,
  "ability:purepower": 976,
  "ability:refrigerate": 977,
  "move:flyingpress": 978,
  "ability:corrosion": 979,
  "ability:merciless": 980,
  "base_stat:hp:35": 981,
  "item:lightball": 982,
  "move:volttackle": 983,
  "base_stat:def:68": 984,
  "base_stat:spa:112": 985,
  "base_stat:spd:154": 986,
  "ability:sandspit": 987,
  "move:snore": 988,
  "base_stat:spa:58": 989,
  "base_stat:spe:99": 990,
  "move:trickortreat": 991,
  "move:aquatail": 992,
  "move:clearsmog": 993,
  "move:forestscurse": 994,
  "item:silverpowder": 995,
  "move:counter": 996,
  "ability:bigpecks": 997,
  "move:meteorbeam": 998,
  "move:brutalswing": 999,
  "move:psychup": 1000,
  "move:firstimpression": 1001,
  "ability:toughclaws": 1002,
  "item:houndoominite": 1003,
  "move:fairylock": 1004,
  "ability:longreach": 1005,
  "move:electroball": 1006,
  "move:mudshot": 1007,
  "ability:strongjaw": 1008,
  "move:thunderfang": 1009,
  "move:metalburst": 1010,
  "move:tickle": 1011,
  "move:horndrill": 1012,
  "item:cheriberry": 1013,
  "move:toxicthread": 1014,
  "move:block": 1015,
  "move:mistyterrain": 1016,
  "base_stat:def:58": 1017,
  "base_stat:spd:58": 1018,
  "base_stat:spe:97": 1019,
  "ability:hungerswitch": 1020,
  "move:aurawheel": 1021,
  "ability:opportunist": 1022,
  "base_stat:hp:67": 1023,
  "base_stat:atk:58": 1024,
  "base_stat:def:57": 1025,
  "ability:cheekpouch": 1026,
  "move:charm": 1027,
  "move:burningjealousy": 1028,
  "move:fellstinger": 1029,
  "ability:pickup": 1030,
  "move:tearfullook": 1031,
  "move:acidarmor": 1032,
  "ability:reckless": 1033,
  "move:iciclespear": 1034,
  "move:skittersmack": 1035,
  "move:shadowpunch": 1036,
  "move:agility": 1037,
  "ability:anticipation": 1038,
  "ability:supersweetsyrup": 1039,
  "move:hardpress": 1040,
  "base_stat:spa:134": 1041,
  "base_stat:spd:114": 1042,
  "ability:sandforce": 1043,
  "move:metalsound": 1044,
  "move:fly": 1045,
  "move:roleplay": 1046,
  "move:flatter": 1047,
  "move:smartstrike": 1048,
  "move:steelroller": 1049,
  "move:blastburn": 1050,
  "move:razorshell": 1051,
  "move:meanlook": 1052,
  "move:torment": 1053,
  "move:nobleroar": 1054,
  "base_stat:atk:127": 1055,
  "base_stat:def:184": 1056,
  "base_stat:spa:34": 1057,
  "base_stat:spd:36": 1058,
  "base_stat:spe:38": 1059,
  "move:mountaingale": 1060,
  "ability:curiousmedicine": 1061,
  "move:thrash": 1062,
  "move:rockwrecker": 1063,
  "move:powerswap": 1064,
  "ability:forecast": 1065,
  "move:lavaplume": 1066,
  "move:sparklingaria": 1067,
  "move:spiritshackle": 1068,
  "move:reversal": 1069,
  "ability:gluttony": 1070,
  "move:ragingfury": 1071,
  "move:skyattack": 1072,
  "move:grassyterrain": 1073,
  "move:risingvoltage": 1074,
  "base_stat:spe:77": 1075,
  "ability:hydration": 1076,
  "move:charge": 1077,
  "ability:stench": 1078,
  "move:belch": 1079,
  "item:heatrock": 1080,
  "item:lifeorb": 1081,
  "item:blacksludge": 1082,
  "move:screech": 1083,
  "move:teatime": 1084,
  "move:stormthrow": 1085,
  "move:aquaring": 1086,
  "move:zapcannon": 1087,
  "base_stat:spe:54": 1088,
  "base_stat:def:99": 1089,
  "base_stat:spa:66": 1090,
  "base_stat:spd:84": 1091,
  "ability:mimicry": 1092,
  "move:snaptrap": 1093,
  "ability:receiver": 1094,
  "base_stat:spa:44": 1095,
  "base_stat:spd:46": 1096,
  "base_stat:spe:28": 1097,
  "move:grassyglide": 1098,
  "move:frenzyplant": 1099,
  "item:assaultvest": 1100,
  "ability:psychicsurge": 1101,
  "base_stat:spa:35": 1102,
  "item:clearamulet": 1103,
  "base_stat:hp:114": 1104,
  "move:spore": 1105,
  "item:eviolite": 1106,
  "ability:download": 1107,
  "move:aromaticmist": 1108,
  "move:burnup": 1109,
  "item:rawstberry": 1110,
  "item:covertcloak": 1111,
  "base_stat:def:42": 1112,
  "base_stat:spd:42": 1113,
  "item:widelens": 1114,
  "base_stat:hp:113": 1115,
  "base_stat:spe:52": 1116,
  "ability:mindseye": 1117,
  "move:bloodmoon": 1118,
  "base_stat:hp:111": 1119,
  "base_stat:spe:39": 1120,
  "ability:stormdrain": 1121,
  "base_stat:hp:87": 1122,
  "base_stat:spa:133": 1123,
  "base_stat:spe:84": 1124,
  "ability:goodasgold": 1125,
  "move:makeitrain": 1126,
  "item:metagrossite": 1127,
  "item:lightclay": 1128,
  "move:spiritbreak": 1129,
  "base_stat:atk:45": 1130,
  "item:choiceband": 1131,
  "item:powerherb": 1132,
  "base_stat:atk:101": 1133,
  "base_stat:spa:91": 1134,
  "base_stat:spe:15": 1135,
  "item:ejectbutton": 1136,
  "ability:electricsurge": 1137,
  "base_stat:hp:116": 1138,
  "base_stat:spa:107": 1139,
  "item:electricseed": 1140,
  "ability:punkrock": 1141,
  "move:overdrive": 1142,
  "item:loadeddice": 1143,
  "item:throatspray": 1144,
  "ability:klutz": 1145,
  "move:pounce": 1146,
  "item:swampertite": 1147,
  "item:safetygoggles": 1148,
  "ability:neutralizinggas": 1149,
  "item:flameorb": 1150,
  "move:terrainpulse": 1151,
  "nature:timid": 1152,
  "nature:impish": 1153,
  "nature:modest": 1154,
  "nature:hasty": 1155,
  "nature:sassy": 1156,
  "nature:brave": 1157,
  "nature:adamant": 1158,
  "nature:jolly": 1159,
  "nature:calm": 1160,
  "nature:relaxed": 1161,
  "nature:bold": 1162,
  "nature:quiet": 1163,
  "nature:careful": 1164,
  "nature:serious": 1165,
  "move:bonerush": 1166,
  "nature:mild": 1167,
  "nature:rash": 1168,
  "nature:naive": 1169,
  "move:rockpolish": 1170,
  "nature:naughty": 1171,
  "move:bounce": 1172,
  "nature:lonely": 1173,
  "item:leek": 1174,
  "item:abilityshield": 1175,
  "item:laggingtail": 1176,
  "base_stat:hp:150": 1177,
  "base_stat:def:44": 1178,
  "base_stat:spd:54": 1179,
  "item:mawilite": 1180,
  "item:choicespecs": 1181,
  "ability:grassysurge": 1182,
  "base_stat:atk:20": 1183,
  "base_stat:def:35": 1184,
  "base_stat:spa:20": 1185,
  "base_stat:spd:45": 1186,
  "move:mistyexplosion": 1187,
  "nature:gentle": 1188,
  "move:syrupbomb": 1189,
  "move:firelash": 1190,
  "move:amnesia": 1191,
  "ability:steamengine": 1192,
  "ability:vitalspirit": 1193,
  "item:salamencite": 1194,
  "ability:damp": 1195,
  "move:ragefist": 1196,
  "ability:effectspore": 1197,
  "base_stat:def:115": 1198,
  "move:orderup": 1199,
  "ability:commander": 1200,
  "move:spite": 1201,
  "base_stat:atk:78": 1202,
  "base_stat:spa:76": 1203,
  "base_stat:def:66": 1204,
  "base_stat:spd:66": 1205,
  "base_stat:def:135": 1206,
  "nature:bashful": 1207,
  "item:psychicseed": 1208,
  "base_stat:hp:86": 1209,
  "base_stat:spe:73": 1210,
  "move:topsyturvy": 1211,
  "move:zingzap": 1212,
  "item:damprock": 1213,
  "ability:poisonheal": 1214,
  "move:wonderroom": 1215,
  "ability:galvanize": 1216,
  "item:rockyhelmet": 1217,
  "move:pluck": 1218,
  "move:ingrain": 1219,
  "item:tangaberry": 1220,
  "item:malamarite": 1221,
  "ability:gorillatactics": 1222,
  "move:poisonpowder": 1223,
  "item:chilanberry": 1224,
  "move:petaldance": 1225,
  "base_stat:hp:125": 1226,
  "ability:serenegrace": 1227,
  "base_stat:spa:165": 1228,
  "base_stat:spd:135": 1229,
  "move:strangesteam": 1230,
  "base_stat:def:62": 1231,
  "move:healbell": 1232,
  "move:guardsplit": 1233,
  "move:guardswap": 1234,
  "move:inferno": 1235,
  "move:recycle": 1236,
  "move:reflecttype": 1237,
  "move:magnetrise": 1238,
  "move:flail": 1239,
  "move:comeuppance": 1240,
  "move:corrosivegas": 1241,
  "ability:stickyhold": 1242,
  "item:oranberry": 1243,
  "move:poisonfang": 1244,
  "base_stat:atk:89": 1245,
  "base_stat:def:116": 1246,
  "base_stat:spe:33": 1247,
  "move:matblock": 1248,
  "move:sing": 1249,
  "base_stat:spe:69": 1250,
  "item:leppaberry": 1251,
  "base_stat:spa:164": 1252,
  "base_stat:spe:151": 1253,
  "item:lucarionitez": 1254,
  "base_stat:spe:150": 1255,
  "base_stat:spd:76": 1256,
  "base_stat:spe:93": 1257,
  "ability:dancer": 1258,
  "move:revelationdance": 1259,
  "move:chloroblast": 1260,
  "base_stat:atk:103": 1261,
  "base_stat:spa:170": 1262,
  "ability:shadowtag": 1263,
  "base_stat:spa:159": 1264,
  "base_stat:spe:134": 1265,
  "ability:minus": 1266,
  "move:powertrick": 1267,
  "ability:rivalry": 1268,
  "item:aspearberry": 1269,
  "move:sweetscent": 1270,
  "move:magneticflux": 1271,
  "move:axekick": 1272,
  "move:crushclaw": 1273,
  "item:pechaberry": 1274,
  "move:sweetkiss": 1275,
  "item:sceptilite": 1276,
  "move:wrap": 1277,
  "nature:docile": 1278,
  "nature:quirky": 1279,
  "nature:lax": 1280,
  "nature:hardy": 1281,
  "move:tailslap": 1282,
  "move:swallow": 1283,
  "ability:stall": 1284,
  "move:spitup": 1285
}